app/controllers/event_controller.rb

INSERT INTO `events` (`end`, `start`, `title`) VALUES ('2015-11-26 09:00:00', '2015-11-25 09:00:00', 'dsada')
SELECT `events`.* FROM `events`
---
 def create

   if request.post?
     #データの保存
     data = Event.new
     data[:title]  = params[:event][:name]
     data[:start] = Time.at((params[:event][:start].to_i))
     data[:end] = Time.at((params[:event][:end].to_i))
     data.save
   end
   view_data = []
   Event.all.each do |item|

SELECT  `events`.* FROM `events`  WHERE `events`.`id` IS NULL  ORDER BY `events`.`id` DESC LIMIT 1
UPDATE `events` SET `end` = '2015-11-26 15:00:00', `start` = '2015-11-25 15:00:00', `title` = 'テスト2' WHERE `events`.`id` = 43
SELECT `events`.* FROM `events`
---
  def update
    if request.put?
      p '------------------'
      data = Event.where(:id => params[:id]).last
      p "-----data----"
      p data
      data[:title]  = params[:event][:name]
      data[:start] = Time.at((params[:event][:start].to_i))
      data[:end] = Time.at((params[:event][:end].to_i))
      data.save
    end
    view_data = []
    Event.all.each do |item|