app/controllers/super_controller.rb

  def project_list
    @projects = Project.all
---
SELECT `projects`.* FROM `projects`

  def company_list
    @companies = Company.all
---
SELECT `companies`.* FROM `companies`

  def admin_list
    @admins = Admin.all
---
SELECT `admins`.* FROM `admins`